"""a="돼지"
b="정은"
a+=b
print("빌어먹을 "+a+" 엿먹어라")
d="친구야 "
s="화성인 니얼굴  "
s*=999
print(d)
print(s)
f="붉은수령붉은수령붉은수령붉은수령붉은수령붉수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령은붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령붉은수령"
print(len(f))
y=f*10
z=y*1000
print(len(z))
print(z)
print("ggfr","ggdd",sep="\n")
print("ethjsdymrsftu","htzohiohubkjb",sep="\n")"""
a="kosankosankosan"
print(len(a))
b=a*3
d=b*2
print(len(b))
print(d)








